app/controllers/produtos_controller.rb

    def index
        @produtos = Produto.order(nome: :desc).limit 2
        @produto_com_desconto = Produto.order(:preco).limit 1
---
SELECT  "produtos".* FROM "produtos" ORDER BY "produtos"."nome" DESC LIMIT ?  [["LIMIT", 2]]
SELECT  "produtos".* FROM "produtos" ORDER BY "produtos"."preco" ASC LIMIT ?  [["LIMIT", 1]]